[
  {
    "image": "https://www.logo.wine/a/logo/Spotify/Spotify-Icon-Logo.wine.svg",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "id": 1,
    "description": "Spotify is the ultimate music streaming platform that allows you to listen to millions of songs, podcasts, and playlists from all over the world. Discover personalized playlists, enjoy curated recommendations based on your listening habits, create your own playlists, and share music with friends. With Spotify, you can enjoy high-quality audio on any device, whether online or offline. Explore genres, follow your favorite artists, and stay updated with the latest releases. Whether you’re working out, studying, or relaxing, Spotify makes it easy to find the perfect soundtrack for every moment.",
    "size": 98,
    "reviews": "18.5M",
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "230K" },
      { "name": "2 star", "count": "150K" },
      { "name": "3 star", "count": "750K" },
      { "name": "4 star", "count": "3.2M" },
      { "name": "5 star", "count": "14.4M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "WhatsApp Messenger is a secure messaging app that allows free messaging, voice calls, and video calls with anyone worldwide. Send text messages, images, videos, documents, and voice notes instantly. Create groups, broadcast messages, and share your status updates with friends and family. WhatsApp uses end-to-end encryption to ensure complete privacy and safety for your conversations. Its simple, user-friendly interface makes communication easy across multiple devices. With features like location sharing, media sharing, and group chats, WhatsApp is a versatile tool for personal and professional communication, keeping you connected wherever you are.",
    "size": 120,
    "reviews": "130M",
    "ratingAvg": 4.4,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": "5M" },
      { "name": "2 star", "count": "4M" },
      { "name": "3 star", "count": "7M" },
      { "name": "4 star", "count": "15M" },
      { "name": "5 star", "count": "99M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/e/e7/Instagram_logo_2016.svg",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Instagram is a visual social media platform to share photos, videos, and stories with followers. Explore creative content, trending reels, and IGTV videos, while engaging with communities and influencers. Use filters, effects, and creative tools to express yourself, showcase experiences, or promote businesses. Connect with friends, join live sessions, and shop directly from the app. Instagram offers personalized recommendations, discovery features, and a safe environment to interact and share content. From casual sharing to professional branding, it provides endless opportunities for creativity, connection, and social engagement in an interactive, visually rich format.",
    "size": 140,
    "reviews": "120M",
    "ratingAvg": 4.3,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": "7M" },
      { "name": "2 star", "count": "5M" },
      { "name": "3 star", "count": "9M" },
      { "name": "4 star", "count": "19M" },
      { "name": "5 star", "count": "80M" }
    ]
  },
  {
    "image": "https://p16-va-tiktok.ibyteimg.com/obj/musically-maliva-obj/56f4ab72da9c2f03f9dbbe9f42aab933.png",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 4,
    "description": "TikTok is a global platform for creating, sharing, and exploring short-form videos. Express creativity with music, filters, and AR effects while participating in trends and viral challenges. Discover videos tailored to your interests, follow creators, and engage with interactive content. TikTok offers endless entertainment, educational content, and creative inspiration for all users. Share your moments, enjoy community-driven content, and connect with audiences worldwide. With its easy-to-use interface and highly personalized recommendations, TikTok transforms video consumption and content creation, making it fun, immersive, and addictive for millions around the globe every day.",
    "size": 180,
    "reviews": "95M",
    "ratingAvg": 4.5,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": "4M" },
      { "name": "2 star", "count": "3.5M" },
      { "name": "3 star", "count": "6M" },
      { "name": "4 star", "count": "16M" },
      { "name": "5 star", "count": "69.5M" }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/KxeSAjPTKliCErbivNiXrd6cTwfbqUJcbSRPe_IBVK_YmwckfMRS1VIHz-5cgT09yMo",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 5,
    "description":"Snapchat is a multimedia messaging app for sharing photos, videos, and short-lived 'Snaps.' Users can communicate using filters, lenses, and Bitmoji avatars while creating personal or public stories. Discover trending content from creators, engage in chat, and connect with friends with privacy and security. Snapchat provides interactive experiences like games, AR effects, and stickers to make communication fun. Explore memories, save favorite Snaps, and enjoy personalized recommendations. With its ephemeral nature and creative tools, Snapchat offers a dynamic platform to share moments instantly while fostering social interaction and entertainment among users.",
    "size": 95,
    "reviews": "22M",
    "ratingAvg": 4.2,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "1M" },
      { "name": "2 star", "count": "1.2M" },
      { "name": "3 star", "count": "2M" },
      { "name": "4 star", "count": "4.8M" },
      { "name": "5 star", "count": "13M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/4/42/YouTube_icon_%282013-2017%29.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 6,
    "description": "YouTube is a video-sharing platform where users can watch, upload, and share content globally. From tutorials, music videos, movies, and vlogs to live streams, YouTube offers diverse entertainment and educational content. Users can create channels, subscribe to their favorite creators, leave comments, and engage with communities. Features like playlists, watch later, and offline viewing provide convenience and personalized experiences. YouTube supports monetization for creators, fostering innovation and content growth. With powerful search, recommendations, and trending sections, YouTube remains the go-to platform for discovering, consuming, and sharing videos of all kinds, anytime and anywhere.",
    "size": 155,
    "reviews": "155M",
    "ratingAvg": 4.5,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": "9M" },
      { "name": "2 star", "count": "7M" },
      { "name": "3 star", "count": "12M" },
      { "name": "4 star", "count": "28M" },
      { "name": "5 star", "count": "98M" }
    ]
  },
  {
    "image": "https://cdn4.iconfinder.com/data/icons/logos-and-brands/512/227_Netflix_logo-512.png",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 7,
    "description": "Netflix is a leading streaming service offering a wide variety of TV shows, movies, documentaries, and original content. With personalized recommendations, users can explore entertainment tailored to their tastes. Netflix supports multiple devices, offline downloads, and multiple profiles per account. Its intuitive interface allows easy browsing, searching, and instant viewing. From blockbuster films to indie productions, Netflix provides content in various genres, languages, and formats. Regularly updated content libraries ensure fresh entertainment. Netflix also fosters creativity and storytelling through its original productions, making it a global platform for entertainment, learning, and cultural experiences accessible anytime, anywhere.",
    "size": 175,
    "reviews": "26M",
    "ratingAvg": 4.4,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "1.2M" },
      { "name": "2 star", "count": "1.3M" },
      { "name": "3 star", "count": "2.5M" },
      { "name": "4 star", "count": "6M" },
      { "name": "5 star", "count": "15M" }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSWuXTd8cP1CFrV-_QTwHWc6W7V_iEFMPCq6g&s",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 8,
    "description": "X (formerly Twitter) is a social media platform for real-time communication, news, and networking. Users can post short messages called tweets, follow trends, engage in discussions, and interact with friends, celebrities, and brands. X allows sharing text, images, videos, and links while enabling replies, likes, and retweets to amplify conversations. Hashtags and topics help users explore relevant content, participate in communities, and stay informed about global events. With verified accounts, spaces, and multimedia content, X facilitates communication, knowledge-sharing, and entertainment. It serves as a platform for expression, discovery, and meaningful connection in a fast-paced digital world.",
    "size": 110,
    "reviews": "18M",
    "ratingAvg": 4.1,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "1.5M" },
      { "name": "2 star", "count": "1.2M" },
      { "name": "3 star", "count": "2.3M" },
      { "name": "4 star", "count": "4.2M" },
      { "name": "5 star", "count": "8.6M" }
    ]
  },
  {
    "image": "https://thumbs.dreamstime.com/b/g-map-155631944.jpg",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 9,
    "description": "Google Maps is a navigation and mapping application that provides accurate maps, directions, traffic updates, and real-time GPS location tracking. Users can explore streets, cities, and countries, view satellite imagery, and access detailed business information. Features include turn-by-turn navigation, live traffic alerts, public transportation guidance, and route optimization. Users can share locations, review places, save favorites, and discover nearby restaurants, shops, and attractions. Google Maps integrates street view, indoor maps, and personalized recommendations for seamless exploration. It is an essential tool for travelers, commuters, and explorers seeking convenience, accuracy, and interactive mapping experiences worldwide.",
    "size": 160,
    "reviews": "36M",
    "ratingAvg": 4.7,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": "800K" },
      { "name": "2 star", "count": "700K" },
      { "name": "3 star", "count": "1.3M" },
      { "name": "4 star", "count": "4.8M" },
      { "name": "5 star", "count": "29M" }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/82/Telegram_logo.svg",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 10,
    "description": "Telegram is a cloud-based messaging app focused on speed, privacy, and security. Users can send messages, photos, videos, and files of any type while creating groups and channels for communities. End-to-end encryption ensures secure communication, while bots, stickers, and interactive features enhance user experience. Telegram supports multi-device synchronization, voice calls, video calls, and large group chats. Its channels allow broadcasting content to millions, and advanced search and organization tools make information accessible. With its emphasis on privacy, open API, and rich multimedia capabilities, Telegram offers a versatile, reliable platform for personal, professional, and community communication.",
    
    "size": 95,
    "reviews": "12M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "600K" },
      { "name": "2 star", "count": "400K" },
      { "name": "3 star", "count": "800K" },
      { "name": "4 star", "count": "2.8M" },
      { "name": "5 star", "count": "7.2M" }
    ]
  },
  {
    "image": "https://pngimg.com/uploads/discord/discord_PNG8.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 11,
    "description": "Discord is a versatile communication platform designed for gamers, communities, and teams. It allows users to chat via text, voice, and video, join servers, and participate in topic-based channels. Users can create private or public servers, customize roles, share media, and use integrations such as bots and apps. Discord supports direct messaging, streaming, and screen sharing, making collaboration and social interaction seamless. With high-quality audio and flexible moderation tools, it serves as a hub for communities worldwide, combining entertainment, learning, and productivity in one platform that encourages engagement and fosters online connections.",
    "size": 135,
    "reviews": "9.5M",
    "ratingAvg": 4.6,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "300K" },
      { "name": "2 star", "count": "250K" },
      { "name": "3 star", "count": "600K" },
      { "name": "4 star", "count": "2.1M" },
      { "name": "5 star", "count": "6.3M" }
    ]
  },
  {
    "image": "https://img.ausha.co/cb:-U1P~1ddd7/w:322/h:214/q:mauto/dpr:2.6/f:avif/https://www.ausha.co/wp-content/uploads/2021/11/Zoom-Logo.png",
    "title": "Zoom",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 12,
    "description": "Zoom is a leading video conferencing platform enabling online meetings, webinars, and virtual collaboration. It allows users to connect via HD video, audio, and screen sharing from any device. Features include chat, recording, breakout rooms, and integration with productivity tools. Zoom supports large-scale meetings, education, and business communications while maintaining reliability and security. Its intuitive interface simplifies scheduling, joining, and hosting meetings. Users can collaborate in real-time, share documents, and maintain team engagement remotely. Zoom has become essential for remote work, distance learning, and global communication, bridging geographical gaps and enhancing productivity and connectivity worldwide.",
    "size": 100,
    "reviews": "11.5M",
    "ratingAvg": 4.3,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "800K" },
      { "name": "2 star", "count": "700K" },
      { "name": "3 star", "count": "1.2M" },
      { "name": "4 star", "count": "3.2M" },
      { "name": "5 star", "count": "5.8M" }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRokEYt0yyh6uNDKL8uksVLlhZ35laKNQgZ9g&s",
    "title": "LinkedIn",
    "companyName": "Microsoft Corporation",
    "id": 13,
    "description":"LinkedIn is a professional networking platform connecting individuals, businesses, and recruiters worldwide. Users can create profiles highlighting their skills, experience, and education, follow companies, and engage with industry content. LinkedIn supports job searching, professional development, learning through courses, and sharing insights. Networking features include connecting with peers, endorsing skills, and joining groups. Companies can post job openings, share updates, and engage with talent. LinkedIn fosters career growth, knowledge sharing, and professional collaboration, providing tools for personal branding, industry insights, and meaningful connections. It remains an essential platform for career advancement and business networking globally.",
    "size": 145,
    "reviews": "7M",
    "ratingAvg": 4.2,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "200K" },
      { "name": "2 star", "count": "180K" },
      { "name": "3 star", "count": "500K" },
      { "name": "4 star", "count": "1.2M" },
      { "name": "5 star", "count": "4.9M" }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/023/986/911/non_2x/tinder-app-logo-tinder-app-logo-transparent-tinder-app-icon-transparent-free-free-png.png",
    "title": "Tinder",
    "companyName": "Match Group",
    "id": 14,
    "description": "Tinder is a location-based dating and social discovery app enabling users to connect with nearby people. By swiping right to like and left to pass, users explore potential matches. Profiles include photos, bios, and interests to facilitate meaningful connections. Tinder supports messaging between matched users, premium features such as unlimited swipes, boost, and passport to explore other locations. Safety tools, privacy settings, and content moderation ensure a secure experience. With an engaging, gamified interface and large user base, Tinder has become a popular platform for meeting new people, dating, networking, and social interaction worldwide.",
    "size": 85,
    "reviews": "9M",
    "ratingAvg": 4.0,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "400K" },
      { "name": "2 star", "count": "300K" },
      { "name": "3 star", "count": "800K" },
      { "name": "4 star", "count": "2.2M" },
      { "name": "5 star", "count": "5M" }
    ]
  },
  {
    "image": "https://news.airbnb.com/wp-content/uploads/sites/4/2017/01/airbnb_vertical_lockup_web.png?fit=451%2C493",
    "title": "Airbnb",
    "companyName": "Airbnb, Inc.",
    "id": 15,
    "description": "Airbnb is an online marketplace for booking unique accommodations, vacation rentals, and experiences worldwide. Users can browse diverse properties including homes, apartments, villas, and boutique stays, complete with reviews, photos, and pricing details. Hosts can list properties, manage bookings, and communicate with guests. Airbnb also offers curated experiences and local activities to enrich travel. With secure payments, verified profiles, and personalized recommendations, Airbnb facilitates safe, convenient, and memorable travel planning. It connects travelers with hosts and communities, enabling cultural exchange and exploration. Airbnb has transformed how people travel, experience destinations, and connect globally.",
    "size": 110,
    "reviews": "5M",
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "100K" },
      { "name": "2 star", "count": "90K" },
      { "name": "3 star", "count": "200K" },
      { "name": "4 star", "count": "900K" },
      { "name": "5 star", "count": "3.1M" }
    ]
  },
  {
    "image": "https://i.pinimg.com/736x/56/3a/a2/563aa2189ef92dc242a7db5b91078804.jpg",
    "title": "Adobe Photoshop",
    "companyName": "Adobe Inc.",
    "id": 16,
    "description": "Adobe Photoshop is a professional photo editing and graphic design software used worldwide by photographers, designers, and artists. It allows for image retouching, compositing, color correction, and creative digital artwork. Features include layers, masks, filters, 3D editing, and advanced selection tools. Users can create, manipulate, and enhance images for print, web, and multimedia projects. Integration with Adobe Creative Cloud provides seamless collaboration, cloud storage, and access to complementary applications. Photoshop empowers creativity and professional-quality results, making it the industry standard for image editing, digital illustration, design projects, and visual storytelling across multiple industries.",
    "size": 250,
    "reviews": "4M",
    "ratingAvg": 4.7,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "50K" },
      { "name": "2 star", "count": "40K" },
      { "name": "3 star", "count": "150K" },
      { "name": "4 star", "count": "900K" },
      { "name": "5 star", "count": "3.05M" }
    ]
  },
  {
    "image": "https://img.icons8.com/?size=1200&id=FrrWYTyu3vLa&format=png",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "id": 17,
    "description":"Slack is a team communication and collaboration platform that integrates messaging, file sharing, and productivity tools. Users can create channels for projects, topics, or departments, share files, and communicate in real-time. Features include direct messaging, voice and video calls, integrations with apps, and customizable notifications. Slack supports remote teams, project management, and workflow automation to enhance productivity and coordination. With robust search, threaded conversations, and security features, Slack fosters efficient communication and collaboration. It is widely used in business, education, and communities to streamline communication, organize tasks, and maintain transparent teamwork.", 
    "size": 120,
    "reviews": "2.5M",
    "ratingAvg": 4.5,
    "downloads": "100M",
    "ratings": [
      { "name": "1 star", "count": "40K" },
      { "name": "2 star", "count": "30K" },
      { "name": "3 star", "count": "120K" },
      { "name": "4 star", "count": "500K" },
      { "name": "5 star", "count": "1.62M" }
    ]
  },
  {
    "image": "https://img.icons8.com/?size=1200&id=13630&format=jpg",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 18,
    "description": "Google Drive is a cloud-based storage service that allows users to safely store, access, and share files from anywhere. It supports documents, spreadsheets, presentations, photos, and videos. Users can collaborate in real-time, control sharing permissions, and access revision history. Integration with Google Workspace apps such as Docs, Sheets, and Slides enhances productivity and seamless workflow. Google Drive offers robust search, offline access, and file synchronization across devices. With secure encryption and extensive sharing capabilities, it has become essential for personal use, education, and business collaboration, enabling users to manage, organize, and share their digital content effortlessly.",
    "size": 130,
    "reviews": "20M",
    "ratingAvg": 4.6,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": "400K" },
      { "name": "2 star", "count": "300K" },
      { "name": "3 star", "count": "1M" },
      { "name": "4 star", "count": "4M" },
      { "name": "5 star", "count": "14.3M" }
    ]
  },
  {
    "image": "https://www.logo-designer.co/storage/2017/10/2017-dropbox-new-logo-design-2.png",
    "title": "Dropbox",
    "companyName": "Dropbox, Inc.",
    "id": 19,
    "description": "Dropbox is a cloud storage platform that helps individuals and businesses store, sync, and share files securely. Users can upload documents, images, and videos, access them from any device, and collaborate in real-time. Features include file versioning, sharing links, team folders, and integrations with productivity tools. Dropbox enables seamless workflow management, backup, and file organization. It ensures data security with encryption and advanced permission settings. With its intuitive interface and powerful collaboration capabilities, Dropbox has become a preferred solution for personal use, remote teams, creative professionals, and businesses seeking efficient cloud storage and file sharing solutions.",
    "size": 90,
    "reviews": "3M",
    "ratingAvg": 4.4,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "100K" },
      { "name": "2 star", "count": "90K" },
      { "name": "3 star", "count": "200K" },
      { "name": "4 star", "count": "700K" },
      { "name": "5 star", "count": "1.91M" }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/042/127/158/non_2x/round-blue-facebook-logo-with-white-thick-border-and-long-shadow-on-a-transparent-background-free-png.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 20,
    "description":"Facebook is a social networking platform that allows users to connect, communicate, and share content with friends, family, and communities. Users can post updates, photos, and videos, engage through likes, comments, and reactions, and join groups of shared interest. Facebook supports events, marketplace, pages for businesses, and content discovery via news feed. With integrated messaging and video calls, it serves as a hub for social interaction, entertainment, and networking. Facebook continually evolves with features for safety, engagement, and personalization, making it one of the most widely used platforms for online social connection, media sharing, and community building worldwide.",
    "size": 150,
    "reviews": "100M",
    "ratingAvg": 4.3,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": "8M" },
      { "name": "2 star", "count": "6M" },
      { "name": "3 star", "count": "10M" },
      { "name": "4 star", "count": "20M" },
      { "name": "5 star", "count": "56M" }
    ]
  },
  {
    "image": "https://play-lh.googleusercontent.com/9jcxRm8DMqox-b1VwJclSwgZrDBiqSKiy_POHGmx6xSkiwvxrljh0U_2ZRtrUDOZaHo",
    "title": "TikTok Lite",
    "companyName": "ByteDance Ltd.",
    "id": 21,
    "description":"TikTok Lite is a lightweight version of TikTok designed for low-end devices and slow internet connections. Users can watch, create, and share short, engaging videos with effects, filters, and music. The app maintains the core TikTok experience while reducing storage and data usage, allowing smooth performance on limited hardware. TikTok Lite provides personalized content recommendations, trends, and social sharing options. Users can follow creators, interact through likes, comments, and shares, and explore global content. It ensures entertainment and social engagement while being accessible, efficient, and optimized for users who want the TikTok experience without consuming excessive device resources.",
    "size": 50,
    "reviews": "15M",
    "ratingAvg": 4.4,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "1M" },
      { "name": "2 star", "count": "900K" },
      { "name": "3 star", "count": "2M" },
      { "name": "4 star", "count": "5M" },
      { "name": "5 star", "count": "6.1M" }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/018/930/474/non_2x/reddit-logo-reddit-icon-transparent-free-png.png",
    "title": "Reddit",
    "companyName": "Reddit, Inc.",
    "id": 22,
    "description": "Reddit is a social news aggregation, discussion, and community platform where users can submit content, vote, and engage in discussions across diverse topics. Communities, called subreddits, focus on interests such as technology, news, entertainment, education, and hobbies. Users can post links, images, and text, comment, and participate in AMAs (Ask Me Anything). Reddit encourages collaboration, sharing, and debate while maintaining content moderation. Features include upvote/downvote systems, awards, and customizable feeds. With its dynamic community-driven approach, Reddit has become a hub for knowledge sharing, trending topics, social interaction, and discovering new ideas globally.",
    "size": 105,
    "reviews": "18M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "1.2M" },
      { "name": "2 star", "count": "1M" },
      { "name": "3 star", "count": "2M" },
      { "name": "4 star", "count": "4.8M" },
      { "name": "5 star", "count": "9M" }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/066/118/541/non_2x/adobe-acrobat-icon-app-logo-editable-transparent-background-premium-social-media-design-for-digital-download-free-png.png",
    "title": "Adobe Acrobat Reader",
    "companyName": "Adobe Inc.",
    "id": 23,
    "description": "Adobe Acrobat Reader is a powerful PDF viewer and editor enabling users to view, edit, annotate, and sign documents easily. It supports PDF creation, conversion, and secure sharing across devices. Users can highlight text, add comments, fill forms, and collaborate efficiently. Integration with cloud storage ensures document access anywhere. With advanced security and document verification features, Adobe Acrobat Reader provides a reliable platform for personal, academic, and professional use. It simplifies workflow management, improves productivity, and ensures accurate handling of PDF files, making it essential for digital document management, communication, and collaboration across industries worldwide.",
    "size": 110,
    "reviews": "7M",
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "300K" },
      { "name": "2 star", "count": "200K" },
      { "name": "3 star", "count": "500K" },
      { "name": "4 star", "count": "1.5M" },
      { "name": "5 star", "count": "5.5M" }
    ]
  },
  {
    "image": "https://static0.xdaimages.com/wordpress/wp-content/uploads/2020/06/new-google-photos-logo.jpg?w=1200&h=675&fit=crop",
    "title": "Google Photos",
    "companyName": "Google LLC",
    "id": 24,
    "description":"Google Photos is a cloud-based photo and video management app designed to store, organize, and share media effortlessly. It offers automatic backup, intelligent search, and photo editing tools. Users can create albums, collages, animations, and movies, as well as share them with friends and family. AI-driven features include object recognition, face grouping, and automatic enhancements. Google Photos ensures safe storage, easy accessibility across devices, and synchronization with Google Drive. With its intuitive interface and powerful organizational tools, it has become the preferred solution for managing large media collections while enabling seamless sharing and memory preservation globally.",
    "size": 95,
    "reviews": "20M",
    "ratingAvg": 4.7,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": "500K" },
      { "name": "2 star", "count": "400K" },
      { "name": "3 star", "count": "1M" },
      { "name": "4 star", "count": "5M" },
      { "name": "5 star", "count": "13.1M" }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTn-V_Yws5pHhrGBZKesRO9LL15UzF_9Znb20WtktdK5FidezPGcVSy4FB5mgEn9pe7OsU&usqp=CAU",
    "title": "PayPal",
    "companyName": "PayPal Holdings, Inc.",
    "id": 25,
    "description":"PayPal is a secure online payment platform enabling users to send and receive money globally. It supports transactions via email, mobile, and websites, providing buyers and sellers with protection and ease of use. Users can link bank accounts, credit, and debit cards, make purchases, and withdraw funds. PayPal offers features like invoicing, business accounts, subscriptions, and currency conversion. Its encryption, fraud prevention, and buyer protection ensure safe transactions. Widely used for e-commerce, personal transfers, and business payments, PayPal streamlines financial operations, allowing convenient, reliable, and fast digital payments for individuals and businesses worldwide.",
    "size": 85,
    "reviews": "12M",
    "ratingAvg": 4.6,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": "400K" },
      { "name": "2 star", "count": "300K" },
      { "name": "3 star", "count": "1M" },
      { "name": "4 star", "count": "2.5M" },
      { "name": "5 star", "count": "8.8M" }
    ]
  },
  {
    "image": "https://logos-world.net/wp-content/uploads/2020/09/Chrome-Logo.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "id": 26,
    "description": "Google Chrome is a fast, secure, and versatile web browser providing seamless browsing across devices. It supports tabbed browsing, bookmarks, extensions, incognito mode, and synchronization with Google accounts. Chrome offers high-speed performance, safe browsing features, and regular updates to enhance security and user experience. Integrated search, autofill, and developer tools empower users for personal, educational, and professional use. Chrome's intuitive interface, lightweight design, and compatibility with web standards make it a preferred choice for millions globally. With robust privacy controls and extensive extension support, it enables efficient internet access, productivity, and digital exploration worldwide.",
    "size": 150,
    "reviews": "100M",
    "ratingAvg": 4.5,
    "downloads": "10B",
    "ratings": [
      { "name": "1 star", "count": "5M" },
      { "name": "2 star", "count": "4M" },
      { "name": "3 star", "count": "12M" },
      { "name": "4 star", "count": "25M" },
      { "name": "5 star", "count": "54M" }
    ]
  },
  {
    "image": "https://images.seeklogo.com/logo-png/25/1/microsoft-logo-png_seeklogo-258454.png",
    "title": "Microsoft Office",
    "companyName": "Microsoft Corporation",
    "id": 27,
    "description": "Microsoft Office is a comprehensive productivity suite that includes Word, Excel, PowerPoint, Outlook, and other applications. It provides tools for creating, editing, and managing documents, spreadsheets, presentations, and emails. Office supports collaboration through cloud integration, real-time co-authoring, and sharing via OneDrive. Features like templates, charts, formulas, and automation enhance productivity and professional workflow. It is widely used in education, business, and personal projects. With its robust feature set, compatibility, and cross-platform support, Microsoft Office remains a standard for productivity, enabling users to efficiently create, communicate, and organize work across various domains.",
    "size": 300,
    "reviews": "50M",
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "2M" },
      { "name": "2 star", "count": "2M" },
      { "name": "3 star", "count": "5M" },
      { "name": "4 star", "count": "13M" },
      { "name": "5 star", "count": "28M" }
    ]
  },
  {
    "image": "https://thumbs.dreamstime.com/b/print-383948851.jpg",
    "title": "WhatsApp Business",
    "companyName": "Meta Platforms, Inc.",
    "id": 28,
    "description": "WhatsApp Business is a communication platform designed for small and medium-sized businesses to connect with customers. It enables sending messages, notifications, and updates securely and efficiently. Features include business profiles, automated replies, labels, catalogs, and quick responses to streamline communication. Customers can interact, ask questions, and make inquiries conveniently. Integration with WhatsApp Web and cloud storage enhances workflow. The platform offers end-to-end encryption, ensuring privacy for both businesses and clients. WhatsApp Business helps businesses manage relationships, improve customer engagement, and maintain professional communication while providing accessibility, reliability, and ease of interaction globally.",
    "size": 125,
    "reviews": "15M",
    "ratingAvg": 4.4,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": "600K" },
      { "name": "2 star", "count": "400K" },
      { "name": "3 star", "count": "1M" },
      { "name": "4 star", "count": "3M" },
      { "name": "5 star", "count": "10M" }
    ]
  }
]
